app/views/trains/_form.html.erb

SELECT "routes".* FROM "routes"
---
    <%= form.label :route %>
    <%= form.collection_select :route_id, Route.all, :id, :name %>