app/views/trains/show.html.erb

<p>
  <% if @train.cars.empty? %>
---
SELECT "cars".* FROM "cars" WHERE "cars"."train_id" = ?  [["train_id", 4]]
SELECT 1 AS one FROM "cars" WHERE "cars"."train_id" = ? LIMIT ?  [["train_id", 4], ["LIMIT", 1]]

    <strong>Second class cars number:</strong>
    <%= @train.cars.count {|c| c.type == 'CoupeCar'} %><br>
---
SELECT "cars".* FROM "cars" WHERE "cars"."train_id" = ?  [["train_id", 4]]
SELECT COUNT(*) FROM "cars" WHERE "cars"."train_id" = ?  [["train_id", 1]]

    <strong>Third class cars number:</strong>
    <%= @train.cars.count {|c| c.type == 'EconomyCar'} %>
---
SELECT "cars".* FROM "cars" WHERE "cars"."train_id" = ?  [["train_id", 1]]