app/controllers/cars_controller.rb

SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @car = Car.find(params[:id])

INSERT INTO "cars" ("kind", "top_places", "lower_places", "train_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["kind", "Плацкарт"], ["top_places", 30], ["lower_places", 10], ["train_id", 3], ["created_at", "2019-10-20 14:57:41.105102"], ["updated_at", "2019-10-20 14:57:41.105102"]]
---
  def create
    @car = @train.cars.new(car_params)

    if @car.save

UPDATE "cars" SET "kind" = ?, "top_places" = ?, "lower_places" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["kind", "Second class"], ["top_places", 1000], ["lower_places", 1000], ["updated_at", "2019-10-20 16:38:05.203638"], ["id", 2]]
---
  def update
    if @car.update(car_params)

SELECT "trains".* FROM "trains" WHERE "trains"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def set_train
    @train = Train.find(params[:train_id])