app/controllers/routes_controller.rb

  def index
    @routes = Route.all
---
SELECT "routes".* FROM "routes"

  def set_route
    @route = Route.find(params[:id])
---
SELECT "routes".* FROM "routes" WHERE "routes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]