app/controllers/trains_controller.rb

  def index
    @trains = Train.all
---
SELECT "trains".* FROM "trains"

  def create
    @train = Train.new(train_params)

    if @train.save
---
INSERT INTO "trains" ("number", "created_at", "updated_at") VALUES (?, ?, ?)  [["number", "679"], ["created_at", "2019-10-19 16:29:13.282700"], ["updated_at", "2019-10-19 16:29:13.282700"]]

  def update
    if @train.update(train_params)
---
UPDATE "trains" SET "route_id" = ?, "updated_at" = ? WHERE "trains"."id" = ?  [["route_id", 1], ["updated_at", "2019-10-19 17:15:54.090619"], ["id", 4]]

  def destroy
    @train.destroy
---
DELETE FROM "trains" WHERE "trains"."id" = ?  [["id", 4]]

  def set_train
    @train = Train.find(params[:id])
---
SELECT "trains".* FROM "trains" WHERE "trains"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]