app/views/routes/show.html.erb

SELECT "trains".* FROM "trains" WHERE "trains"."route_id" = ?  [["route_id", 1]]
SELECT 1 AS one FROM "trains" WHERE "trains"."route_id" = ? LIMIT ?  [["route_id", 1], ["LIMIT", 1]]
---

<% if @route.trains.empty?%>

SELECT "trains".* FROM "trains" WHERE "trains"."route_id" = ?  [["route_id", 1]]
---
  <ol>
    <% @route.trains.each do |t| %>