app/views/cars/_form.html.erb

SELECT "trains".* FROM "trains"
---
    <%= f.label :train %>
    <%= f.collection_select :train_id, Train.all, :id, :number %>